<h1> 第二章 UNIXコマンド

データ読み込み(最初に実行しよう)

In [21]:
# !wget https://nlp100.github.io/data/popular-names.txt

In [22]:
import pandas as pd
df = pd.read_csv("data/popular-names.txt", sep='\t', header=None)
df.columns = ["name", 'sex', 'number', 'year']
df.head()

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

<h3>10: 行数をカウントせよ．確認にはwcコマンドを用いよ．

In [23]:
len(df)

2780

In [24]:
!wc -l ./data/popular-names.txt

    2780 ./data/popular-names.txt

<h3>11: タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [25]:
!tr '\t' ' ' < data/popular-names.txt > ./output/output.txt

<h3>12: 各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [26]:
col1 = df["name"]
col2 = df["sex"]

col1.to_csv("./output/col1.txt", index=False)
col2.to_csv("./output/col2.txt", index=False)

In [27]:
!cut -f 1 data/popular-names.txt > ./output/col1.txt
!cut -f 2 data/popular-names.txt > ./output/col2.txt

<h3>13: 作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [28]:
df1 = pd.read_table("output/col1.txt")
df2 = pd.read_table("output/col2.txt")
df = pd.concat([df1, df2], axis=1)
df.to_csv("./output/merged.txt", sep="\t", index=False)

In [29]:
!paste output/col1.txt output/col2.txt > ./output/merged.txt

<h3>14: 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [30]:
N = int(input())
df.head(N)

        Mary  F
0       Anna  F
1       Emma  F
2  Elizabeth  F
3     Minnie  F
4   Margaret  F
5        Ida  F
6      Alice  F
7     Bertha  F
8      Sarah  F
9       John  M

In [31]:
!head -n 5 data/popular-names.txt

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880

<h3>15: 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [32]:
N = int(input())
df.tail(N)

          Mary  F
2769      Liam  M
2770      Noah  M
2771   William  M
2772     James  M
2773    Oliver  M
2774  Benjamin  M
2775    Elijah  M
2776     Lucas  M
2777     Mason  M
2778     Logan  M

In [33]:
!tail -n 5 data/popular-names.txt

Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

<h3>16: 自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN行ずつ分割せよ．同様の処理をsplitコマンドで実現せよ．

In [34]:
import pandas as pd
df = pd.read_csv("data/popular-names.txt", sep='\t', header=None)
df.columns = ["name", 'sex', 'number', 'year']

N = 2
df["bins"] = pd.qcut(range(len(df)), N, labels=False)
groups = df.groupby("bins")

for group_name, group_data in groups:
    file_path = f"./output/split_{group_name:02}.txt"
    group_data.drop(columns="bins").to_csv(file_path, sep="\t", index=False, header=False)

In [35]:
# !split -l 1500 -d popular-names.txt ./output/split_

<h3>17: 1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [36]:
import pandas as pd
df = pd.read_csv("data/popular-names.txt", sep='\t', header=None)
df.columns = ["name", 'sex', 'number', 'year']

len(df["name"].unique())

136

In [37]:
!cut -f 1 data/popular-names.txt | sort | uniq | wc -l

     136

<h3>18: 各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [38]:
import pandas as pd
df = pd.read_csv("data/popular-names.txt", sep='\t', header=None)
df.columns = ["name", 'sex', 'number', 'year']
df_sorted = df.sort_values(by="number", ascending=False)
df_sorted.head()

         name sex  number  year
1340    Linda   F   99689  1947
1360    Linda   F   96211  1948
1350    James   M   94757  1947
1550  Michael   M   92704  1957
1351   Robert   M   91640  1947

In [39]:
!cat ./data/popular-names.txt | sort -rnk 3 | head -n 5

Linda	F	99689	1947
Linda	F	96211	1948
James	M	94757	1947
Michael	M	92704	1957
Robert	M	91640	1947
sort: Broken pipe

<h3>19: 各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [40]:
import pandas as pd
df = pd.read_csv("data/popular-names.txt", sep='\t', header=None)
df.columns = ["name", 'sex', 'number', 'year']

df["name"].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Scott        1
Rachel       1
Kelly        1
Crystal      1
Lucas        1
Name: name, Length: 136, dtype: int64

In [41]:
!cut -f 1 ./data/popular-names.txt | sort | uniq -c | sort -rn

 118 James
 111 William
 108 Robert
 108 John
  92 Mary
  75 Charles
  74 Michael
  73 Elizabeth
  70 Joseph
  60 Margaret
  58 Thomas
  58 George
  57 David
  51 Richard
  45 Helen
  43 Frank
  43 Christopher
  41 Anna
  40 Edward
  39 Ruth
  38 Patricia
  37 Matthew
  36 Dorothy
  35 Emma
  32 Barbara
  31 Joshua
  31 Daniel
  26 Sarah
  26 Linda
  26 Jennifer
  26 Emily
  25 Jessica
  25 Jacob
  24 Susan
  24 Mildred
  24 Betty
  23 Henry
  23 Ashley
  22 Nancy
  21 Andrew
  20 Marie
  20 Florence
  20 Donald
  20 Amanda
  19 Samantha
  18 Olivia
  18 Melissa
  18 Madison
  18 Lisa
  18 Karen
  17 Stephanie
  17 Abigail
  16 Sandra
  16 Mark
  16 Ethel
  15 Michelle
  15 Isabella
  15 Heather
  15 Frances
  15 Ethan
  15 Carol
  15 Angela
  14 Shirley
  14 Kimberly
  14 Ava
  14 Amy
  13 Virginia
  13 Sophia
  13 Nicole
  13 Jason
  13 Hannah
  13 Deborah
  13 Brian
  12 Minnie
  12 Donna
  12 Bertha
  11 Cynthia
  10 Ronald
  10 Noah
  10 Nicholas
  10 Mia
  10 Doris
  10 Brittany
  10 Alice
   9 Tyler
   9 Joan
   9 Debra
   8 Taylor
   8 Mason
   8 Judith
   8 Ida
   8 Clara
   8 Alexis
   8 Alexander
   7 Tammy
   7 Steven
   7 Sharon
   7 Liam
   7 Harry
   7 Brandon
   6 Anthony
   5 Jeffrey
   5 Jayden
   5 Gary
   5 Charlotte
   5 Annie
   4 Lillian
   4 Kathleen
   4 Justin
   4 Chloe
   4 Benjamin
   4 Austin
   3 Megan
   3 Harper
   3 Evelyn
   3 Elijah
   3 Aiden
   2 Rebecca
   2 Oliver
   2 Logan
   2 Lauren
   2 Larry
   2 Bessie
   2 Amelia
   1 Walter
   1 Tracy
   1 Scott
   1 Rachel
   1 Pamela
   1 Lucas
   1 Lori
   1 Laura
   1 Kelly
   1 Julie
   1 Crystal
   1 Carolyn